import math
import time

import pymysql
from lxml import html
import jieba
from wordcloud import WordCloud
from selenium import webdriver
from selenium.webdriver.chrome.options import Options


def coon():
    con = pymysql.connect(port=3306, password='fsq20010701', user='root', host="localhost", db="p_music")
    cur = con.cursor()
    return con, cur


def close():
    con, cur = coon()
    cur.close()
    con.close()


def insert(sql):
    con, cur = coon()
    cur.execute(sql)
    con.commit()
    close()


def query(sql):
    con, cur = coon()
    cur.execute(sql)
    res = cur.fetchall()
    close()
    return res


def getuserinfo(id):
    sql = 'select `nickname`,`art` from tb_user where userid = {0}'.format(id)
    res = query(sql)[0]
    if res[0] == None:
        data = {
            'userinfo': 'null',
            'info': '用户还没有绑定信息'
        }
        return data
    else:
        arturl = res[1].split('\'')[1]
        data = {
            'info': 'success',
            'userinfo': [res[0], arturl]
        }
        return data


def getallsong():
    sql = 'select * from tb_music limit 0,10'
    res = query(sql)
    allli = []
    for i in res:
        data = {}
        data['songname'] = i[7]
        data['songtime'] = i[1]
        data['songimg'] = i[4]
        data['songauther'] = i[2]
        data['songpl'] = i[5]
        data['songlx'] = i[6]
        data['songzj'] = i[3]
        data['songid'] = i[0]
        allli.append(data)
    return allli


def GetAllUserInfo(id):
    sql = 'select * from tb_user where userid = {0}'.format(id)
    res = query(sql)
    userinfolist = []
    usersc = []
    userplaty = []
    for i in res:
        userinfolist.append(list(i))

    sql = 'select *  from tb_user_sc where userid = {0};'.format(id)
    res = query(sql)
    for i in res:
        usersc.append(list(i))

    sql = 'select *  from tb_user_platy where userid = {0};'.format(id)
    res = query(sql)
    for i in res:
        userplaty.append(list(i))
    return userinfolist, usersc, userplaty


def sc(songid, userid):
    sql = 'select * from tb_user_sc where songid = {0} and userid = {1}'.format(songid, userid)
    res = query(sql)
    if res != ():
        data = {
            "info": "该歌曲已经收藏,请勿重复收藏"
        }
        return data
    else:
        sql = 'insert into tb_user_sc(`songid`,`userid`) values("%s","%s")' % (songid, userid)
        insert(sql)

        data = {
            'info': "收藏成功"
        }
        return data


def userdel(songid, userid):
    sql = 'delete from  tb_user_sc where songid = {0} and userid = {1}'.format(songid, userid)
    insert(sql)
    data = {
        'info': "取消收藏成功"
    }
    return data


def getsc(userid):
    sql = 'select `songid` from tb_user_sc where `userid` = {0}'.format(userid)
    res = query(sql)
    allli = []
    for i in res:
        sql = 'select * from tb_music where songid = {0}'.format(i[0])
        res = query(sql)
        for i in res:
            data = {}
            data['songname'] = i[7]
            data['songtime'] = i[1]
            data['songimg'] = i[4]
            data['songauther'] = i[2]
            data['songpl'] = i[5]
            data['songlx'] = i[6]
            data['songzj'] = i[3]
            data['songid'] = i[0]
            allli.append(data)
    return allli


def userplay(songid, userid):
    now = int(round(time.time() * 1000))
    now02 = time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(now / 1000))
    sql = 'REPLACE INTO tb_user_platy(`songid`,`userid`,`playtime`) values ("%s","%s","%s")' % (songid, userid, now02)
    insert(sql)
    data = {'info': "ok"}
    return data


def getplay(userid):
    sql = 'select `songid`,`playtime` from tb_user_platy where `userid` = {0}'.format(userid)
    res = query(sql)
    allli = []
    for i in res:
        sql = 'select * from tb_music where songid = {0}'.format(i[0])
        res = query(sql)
        data = {}
        for x in res:
            data['songname'] = x[7]
            data['songtime'] = x[1]
            data['songimg'] = x[4]
            data['songauther'] = x[2]
            data['songpl'] = x[5]
            data['songlx'] = x[6]
            data['songzj'] = x[3]
            data['songid'] = x[0]
            data['playtime'] = i[1]
            allli.append(data)
    return allli


def userclean(userid):
    sql = 'delete from tb_user_platy where userid = {0}'.format(userid)
    insert(sql)
    data = {
        'info': '清空成功'
    }
    return data


def seachallsong(key):
    sql = 'select * from tb_music where songlx = "{0}" limit 0,30'.format(key)
    res = query(sql)
    allli = []
    for i in res:
        data = {}
        data['songname'] = i[7]
        data['songtime'] = i[1]
        data['songimg'] = i[4]
        data['songauther'] = i[2]
        data['songpl'] = i[5]
        data['songlx'] = i[6]
        data['songzj'] = i[3]
        data['songid'] = i[0]
        allli.append(data)
    return allli


class ItemCF(object):
    def __init__(self, userid):
        self.userid = userid
        self.user_score_dict = self.initUserScore()
        self.items_sim = self.ItemSimilarityBest()

    def cftest(self):
        sql = 'select `songid` from tb_user_sc where userid = {0}'.format(self.userid)
        res = query(sql)
        data = {}
        num = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ]
        list = ['流行', '摇滚', '民谣', '电子', '舞曲', '说唱', '轻音乐', '爵士', 'R&B/Soul', '古典', '民族', '英伦', '蓝调', '雷鬼',
                '世界音乐','拉丁', 'New Age', '古风', 'Bossa Nova']
        for x in res:
            sql = 'select songlx from tb_music where songid = {0}'.format(x[0])
            res1 = query(sql)[0]
            if res1[0] in list:
                index = list.index(res1[0])
                num[index] += 1

        for z in range(0, len(num)):
            data[list[z]] = num[z]

        return data

    def initUserScore(self):
        test = {'100': {'流行': 7, '摇滚': 96, '民谣': 0, '电子': 86, '舞曲': 56, '说唱': 95, '轻音乐': 85, '爵士': 81,
                        'R&B/Soul': 55, '古典': 21, '民族': 90, '英伦': 80, '蓝调': 44, '雷鬼': 50, '世界音乐': 11, '拉丁': 83,
                        'New Age': 21, '古风': 19, 'Bossa Nova': 22},
                '101': {'流行': 60, '摇滚': 17, '民谣': 8, '电子': 92, '舞曲': 7, '说唱': 11, '轻音乐': 92, '爵士': 51,
                        'R&B/Soul': 4,
                        '古典': 30, '民族': 52, '英伦': 56, '蓝调': 49, '雷鬼': 15, '世界音乐': 99, '拉丁': 100,
                        'New Age': 17,
                        '古风': 58, 'Bossa Nova': 1},
                '102': {'流行': 37, '摇滚': 76, '民谣': 51, '电子': 82, '舞曲': 21, '说唱': 62, '轻音乐': 71, '爵士': 5,
                        'R&B/Soul': 30, '古典': 31, '民族': 43, '英伦': 90, '蓝调': 8, '雷鬼': 58, '世界音乐': 15, '拉丁': 92,
                        'New Age': 53, '古风': 63, 'Bossa Nova': 9},
                '103': {'流行': 96, '摇滚': 53, '民谣': 8, '电子': 83, '舞曲': 33, '说唱': 13, '轻音乐': 23, '爵士': 75,
                        'R&B/Soul': 40, '古典': 72, '民族': 3, '英伦': 97, '蓝调': 29, '雷鬼': 61, '世界音乐': 70, '拉丁': 79,
                        'New Age': 28, '古风': 48, 'Bossa Nova': 93},
                '104': {'流行': 27, '摇滚': 97, '民谣': 36, '电子': 44, '舞曲': 0, '说唱': 27, '轻音乐': 0, '爵士': 76,
                        'R&B/Soul': 84, '古典': 93, '民族': 10, '英伦': 19, '蓝调': 5, '雷鬼': 8, '世界音乐': 74, '拉丁': 29,
                        'New Age': 34, '古风': 98, 'Bossa Nova': 78},
                '105': {'流行': 81, '摇滚': 20, '民谣': 15, '电子': 7, '舞曲': 59, '说唱': 70, '轻音乐': 90, '爵士': 88,
                        'R&B/Soul': 92, '古典': 1, '民族': 44, '英伦': 95, '蓝调': 17, '雷鬼': 52, '世界音乐': 95, '拉丁': 6,
                        'New Age': 14, '古风': 35, 'Bossa Nova': 16},
                '106': {'流行': 79, '摇滚': 99, '民谣': 78, '电子': 6, '舞曲': 12, '说唱': 34, '轻音乐': 11, '爵士': 45,
                        'R&B/Soul': 14, '古典': 32, '民族': 46, '英伦': 95, '蓝调': 46, '雷鬼': 70, '世界音乐': 24,
                        '拉丁': 11,
                        'New Age': 9, '古风': 22, 'Bossa Nova': 42},
                '107': {'流行': 59, '摇滚': 79, '民谣': 57, '电子': 78, '舞曲': 17, '说唱': 76, '轻音乐': 29, '爵士': 68,
                        'R&B/Soul': 16, '古典': 96, '民族': 28, '英伦': 25, '蓝调': 48, '雷鬼': 37, '世界音乐': 99,
                        '拉丁': 30,
                        'New Age': 0, '古风': 79, 'Bossa Nova': 7},
                '108': {'流行': 60, '摇滚': 44, '民谣': 34, '电子': 97, '舞曲': 32, '说唱': 50, '轻音乐': 54, '爵士': 31,
                        'R&B/Soul': 17, '古典': 51, '民族': 44, '英伦': 26, '蓝调': 28, '雷鬼': 81, '世界音乐': 96, '拉丁': 5,
                        'New Age': 66, '古风': 12, 'Bossa Nova': 58},
                '109': {'流行': 43, '摇滚': 8, '民谣': 37, '电子': 13, '舞曲': 29, '说唱': 31, '轻音乐': 58, '爵士': 29,
                        'R&B/Soul': 98, '古典': 79, '民族': 9, '英伦': 62, '蓝调': 89, '雷鬼': 99, '世界音乐': 87, '拉丁': 14,
                        'New Age': 99, '古风': 4, 'Bossa Nova': 4},
                '110': {'流行': 37, '摇滚': 43, '民谣': 46, '电子': 67, '舞曲': 48, '说唱': 66, '轻音乐': 19, '爵士': 88,
                        'R&B/Soul': 2, '古典': 27, '民族': 100, '英伦': 31, '蓝调': 48, '雷鬼': 8, '世界音乐': 56, '拉丁': 40,
                        'New Age': 89, '古风': 40, 'Bossa Nova': 81},
                '111': {'流行': 100, '摇滚': 67, '民谣': 25, '电子': 95, '舞曲': 38, '说唱': 68, '轻音乐': 78, '爵士': 44,
                        'R&B/Soul': 99, '古典': 43, '民族': 15, '英伦': 58, '蓝调': 62, '雷鬼': 17, '世界音乐': 2, '拉丁': 53,
                        'New Age': 87, '古风': 79, 'Bossa Nova': 10},
                '112': {'流行': 11, '摇滚': 29, '民谣': 55, '电子': 67, '舞曲': 90, '说唱': 21, '轻音乐': 84, '爵士': 65,
                        'R&B/Soul': 5, '古典': 35, '民族': 55, '英伦': 55, '蓝调': 84, '雷鬼': 18, '世界音乐': 11, '拉丁': 24,
                        'New Age': 7, '古风': 19, 'Bossa Nova': 3},
                '113': {'流行': 54, '摇滚': 62, '民谣': 54, '电子': 8, '舞曲': 20, '说唱': 75, '轻音乐': 18, '爵士': 32,
                        'R&B/Soul': 56, '古典': 92, '民族': 26, '英伦': 21, '蓝调': 69, '雷鬼': 32, '世界音乐': 44, '拉丁': 5,
                        'New Age': 90, '古风': 100, 'Bossa Nova': 49},
                '114': {'流行': 93, '摇滚': 100, '民谣': 40, '电子': 87, '舞曲': 23, '说唱': 57, '轻音乐': 10, '爵士': 74,
                        'R&B/Soul': 71, '古典': 60, '民族': 88, '英伦': 15, '蓝调': 22, '雷鬼': 55, '世界音乐': 59,
                        '拉丁': 95,
                        'New Age': 47, '古风': 48, 'Bossa Nova': 65},
                '115': {'流行': 31, '摇滚': 77, '民谣': 47, '电子': 9, '舞曲': 16, '说唱': 99, '轻音乐': 96, '爵士': 99,
                        'R&B/Soul': 2, '古典': 90, '民族': 11, '英伦': 16, '蓝调': 78, '雷鬼': 89, '世界音乐': 61, '拉丁': 23,
                        'New Age': 70, '古风': 11, 'Bossa Nova': 21},
                '116': {'流行': 46, '摇滚': 63, '民谣': 39, '电子': 62, '舞曲': 35, '说唱': 28, '轻音乐': 68, '爵士': 81,
                        'R&B/Soul': 35, '古典': 17, '民族': 14, '英伦': 86, '蓝调': 82, '雷鬼': 83, '世界音乐': 48,
                        '拉丁': 16,
                        'New Age': 64, '古风': 24, 'Bossa Nova': 1},
                '117': {'流行': 12, '摇滚': 96, '民谣': 1, '电子': 38, '舞曲': 68, '说唱': 76, '轻音乐': 28, '爵士': 58,
                        'R&B/Soul': 89, '古典': 14, '民族': 69, '英伦': 15, '蓝调': 66, '雷鬼': 54, '世界音乐': 66,
                        '拉丁': 62,
                        'New Age': 43, '古风': 6, 'Bossa Nova': 11},
                '118': {'流行': 6, '摇滚': 16, '民谣': 88, '电子': 15, '舞曲': 54, '说唱': 90, '轻音乐': 4, '爵士': 1,
                        'R&B/Soul': 0,
                        '古典': 38, '民族': 100, '英伦': 89, '蓝调': 85, '雷鬼': 29, '世界音乐': 45, '拉丁': 70, 'New Age': 7,
                        '古风': 32, 'Bossa Nova': 68},
                '119': {'流行': 51, '摇滚': 68, '民谣': 1, '电子': 42, '舞曲': 84, '说唱': 22, '轻音乐': 2, '爵士': 38,
                        'R&B/Soul': 50, '古典': 65, '民族': 46, '英伦': 0, '蓝调': 77, '雷鬼': 25, '世界音乐': 95, '拉丁': 67,
                        'New Age': 19, '古风': 40, 'Bossa Nova': 60},
                '120': {'流行': 22, '摇滚': 18, '民谣': 84, '电子': 4, '舞曲': 96, '说唱': 34, '轻音乐': 31, '爵士': 25,
                        'R&B/Soul': 4, '古典': 19, '民族': 45, '英伦': 91, '蓝调': 4, '雷鬼': 72, '世界音乐': 71, '拉丁': 24,
                        'New Age': 50, '古风': 54, 'Bossa Nova': 15},
                '121': {'流行': 52, '摇滚': 42, '民谣': 10, '电子': 26, '舞曲': 97, '说唱': 62, '轻音乐': 76, '爵士': 63,
                        'R&B/Soul': 83, '古典': 35, '民族': 62, '英伦': 26, '蓝调': 3, '雷鬼': 73, '世界音乐': 60, '拉丁': 80,
                        'New Age': 30, '古风': 14, 'Bossa Nova': 46},
                '122': {'流行': 51, '摇滚': 44, '民谣': 18, '电子': 41, '舞曲': 50, '说唱': 78, '轻音乐': 77, '爵士': 20,
                        'R&B/Soul': 13, '古典': 15, '民族': 7, '英伦': 48, '蓝调': 37, '雷鬼': 69, '世界音乐': 44,
                        '拉丁': 100,
                        'New Age': 95, '古风': 84, 'Bossa Nova': 48},
                '123': {'流行': 83, '摇滚': 89, '民谣': 13, '电子': 1, '舞曲': 69, '说唱': 51, '轻音乐': 55, '爵士': 79,
                        'R&B/Soul': 60, '古典': 72, '民族': 42, '英伦': 87, '蓝调': 4, '雷鬼': 19, '世界音乐': 98, '拉丁': 47,
                        'New Age': 9, '古风': 39, 'Bossa Nova': 26},
                '124': {'流行': 68, '摇滚': 7, '民谣': 63, '电子': 37, '舞曲': 60, '说唱': 45, '轻音乐': 41, '爵士': 20,
                        'R&B/Soul': 97, '古典': 5, '民族': 32, '英伦': 54, '蓝调': 23, '雷鬼': 6, '世界音乐': 39, '拉丁': 98,
                        'New Age': 73, '古风': 53, 'Bossa Nova': 14},
                '125': {'流行': 100, '摇滚': 79, '民谣': 15, '电子': 88, '舞曲': 20, '说唱': 84, '轻音乐': 26, '爵士': 11,
                        'R&B/Soul': 85, '古典': 54, '民族': 83, '英伦': 79, '蓝调': 25, '雷鬼': 89, '世界音乐': 14,
                        '拉丁': 98,
                        'New Age': 25, '古风': 82, 'Bossa Nova': 19},
                '126': {'流行': 19, '摇滚': 77, '民谣': 45, '电子': 95, '舞曲': 44, '说唱': 75, '轻音乐': 69, '爵士': 99,
                        'R&B/Soul': 76, '古典': 47, '民族': 95, '英伦': 55, '蓝调': 12, '雷鬼': 93, '世界音乐': 78,
                        '拉丁': 94,
                        'New Age': 27, '古风': 69, 'Bossa Nova': 34},
                '127': {'流行': 100, '摇滚': 21, '民谣': 79, '电子': 34, '舞曲': 24, '说唱': 87, '轻音乐': 19, '爵士': 5,
                        'R&B/Soul': 91, '古典': 87, '民族': 67, '英伦': 34, '蓝调': 20, '雷鬼': 92, '世界音乐': 4, '拉丁': 64,
                        'New Age': 14, '古风': 45, 'Bossa Nova': 22},
                '128': {'流行': 34, '摇滚': 45, '民谣': 30, '电子': 79, '舞曲': 42, '说唱': 48, '轻音乐': 52, '爵士': 20,
                        'R&B/Soul': 32, '古典': 57, '民族': 44, '英伦': 62, '蓝调': 57, '雷鬼': 71, '世界音乐': 29,
                        '拉丁': 55,
                        'New Age': 11, '古风': 40, 'Bossa Nova': 29},
                '129': {'流行': 75, '摇滚': 62, '民谣': 37, '电子': 8, '舞曲': 78, '说唱': 62, '轻音乐': 29, '爵士': 19,
                        'R&B/Soul': 79, '古典': 90, '民族': 97, '英伦': 67, '蓝调': 91, '雷鬼': 36, '世界音乐': 93,
                        '拉丁': 11,
                        'New Age': 12, '古风': 75, 'Bossa Nova': 100},
                '130': {'流行': 22, '摇滚': 30, '民谣': 75, '电子': 28, '舞曲': 91, '说唱': 35, '轻音乐': 46, '爵士': 22,
                        'R&B/Soul': 100, '古典': 96, '民族': 62, '英伦': 21, '蓝调': 23, '雷鬼': 68, '世界音乐': 8,
                        '拉丁': 13,
                        'New Age': 28, '古风': 80, 'Bossa Nova': 22},
                '131': {'流行': 12, '摇滚': 18, '民谣': 68, '电子': 98, '舞曲': 97, '说唱': 74, '轻音乐': 100, '爵士': 4,
                        'R&B/Soul': 29, '古典': 45, '民族': 19, '英伦': 18, '蓝调': 49, '雷鬼': 11, '世界音乐': 93, '拉丁': 16,
                        'New Age': 38, '古风': 85, 'Bossa Nova': 0},
                '132': {'流行': 41, '摇滚': 48, '民谣': 69, '电子': 16, '舞曲': 85, '说唱': 100, '轻音乐': 48, '爵士': 44,
                        'R&B/Soul': 46, '古典': 13, '民族': 31, '英伦': 76, '蓝调': 14, '雷鬼': 15, '世界音乐': 28,
                        '拉丁': 80,
                        'New Age': 15, '古风': 91, 'Bossa Nova': 20},
                '133': {'流行': 28, '摇滚': 18, '民谣': 97, '电子': 46, '舞曲': 10, '说唱': 43, '轻音乐': 17, '爵士': 48,
                        'R&B/Soul': 50, '古典': 55, '民族': 54, '英伦': 5, '蓝调': 7, '雷鬼': 5, '世界音乐': 35, '拉丁': 22,
                        'New Age': 68, '古风': 40, 'Bossa Nova': 11},
                '134': {'流行': 26, '摇滚': 45, '民谣': 1, '电子': 64, '舞曲': 54, '说唱': 100, '轻音乐': 84, '爵士': 29,
                        'R&B/Soul': 90, '古典': 88, '民族': 31, '英伦': 97, '蓝调': 84, '雷鬼': 52, '世界音乐': 75,
                        '拉丁': 25,
                        'New Age': 33, '古风': 99, 'Bossa Nova': 66},
                '135': {'流行': 92, '摇滚': 7, '民谣': 94, '电子': 82, '舞曲': 91, '说唱': 82, '轻音乐': 38, '爵士': 85,
                        'R&B/Soul': 84, '古典': 27, '民族': 31, '英伦': 11, '蓝调': 80, '雷鬼': 55, '世界音乐': 90, '拉丁': 1,
                        'New Age': 35, '古风': 0, 'Bossa Nova': 33},
                '136': {'流行': 75, '摇滚': 96, '民谣': 96, '电子': 75, '舞曲': 82, '说唱': 63, '轻音乐': 50, '爵士': 74,
                        'R&B/Soul': 21, '古典': 45, '民族': 35, '英伦': 25, '蓝调': 38, '雷鬼': 5, '世界音乐': 81, '拉丁': 90,
                        'New Age': 46, '古风': 90, 'Bossa Nova': 3},
                '137': {'流行': 75, '摇滚': 93, '民谣': 7, '电子': 68, '舞曲': 37, '说唱': 84, '轻音乐': 13, '爵士': 83,
                        'R&B/Soul': 6, '古典': 26, '民族': 71, '英伦': 58, '蓝调': 12, '雷鬼': 80, '世界音乐': 21, '拉丁': 76,
                        'New Age': 38, '古风': 3, 'Bossa Nova': 10},
                '138': {'流行': 57, '摇滚': 52, '民谣': 45, '电子': 90, '舞曲': 58, '说唱': 95, '轻音乐': 29, '爵士': 55,
                        'R&B/Soul': 2, '古典': 84, '民族': 78, '英伦': 67, '蓝调': 71, '雷鬼': 4, '世界音乐': 98, '拉丁': 81,
                        'New Age': 92, '古风': 91, 'Bossa Nova': 75},
                '139': {'流行': 28, '摇滚': 94, '民谣': 69, '电子': 23, '舞曲': 20, '说唱': 55, '轻音乐': 45, '爵士': 98,
                        'R&B/Soul': 15, '古典': 54, '民族': 6, '英伦': 24, '蓝调': 57, '雷鬼': 59, '世界音乐': 20, '拉丁': 64,
                        'New Age': 66, '古风': 9, 'Bossa Nova': 14},
                '140': {'流行': 45, '摇滚': 56, '民谣': 75, '电子': 2, '舞曲': 11, '说唱': 15, '轻音乐': 90, '爵士': 13,
                        'R&B/Soul': 17, '古典': 15, '民族': 69, '英伦': 78, '蓝调': 58, '雷鬼': 92, '世界音乐': 5, '拉丁': 53,
                        'New Age': 31, '古风': 16, 'Bossa Nova': 33},
                '141': {'流行': 4, '摇滚': 19, '民谣': 37, '电子': 72, '舞曲': 80, '说唱': 41, '轻音乐': 39, '爵士': 81,
                        'R&B/Soul': 16, '古典': 12, '民族': 96, '英伦': 75, '蓝调': 59, '雷鬼': 43, '世界音乐': 70,
                        '拉丁': 22,
                        'New Age': 52, '古风': 79, 'Bossa Nova': 92},
                '142': {'流行': 0, '摇滚': 99, '民谣': 6, '电子': 2, '舞曲': 93, '说唱': 82, '轻音乐': 65, '爵士': 79,
                        'R&B/Soul': 85,
                        '古典': 70, '民族': 1, '英伦': 61, '蓝调': 31, '雷鬼': 42, '世界音乐': 14, '拉丁': 7, 'New Age': 95,
                        '古风': 22, 'Bossa Nova': 37},
                '143': {'流行': 51, '摇滚': 40, '民谣': 20, '电子': 14, '舞曲': 38, '说唱': 63, '轻音乐': 96, '爵士': 79,
                        'R&B/Soul': 23, '古典': 97, '民族': 86, '英伦': 69, '蓝调': 90, '雷鬼': 94, '世界音乐': 76,
                        '拉丁': 17,
                        'New Age': 39, '古风': 11, 'Bossa Nova': 20},
                '144': {'流行': 17, '摇滚': 12, '民谣': 98, '电子': 44, '舞曲': 16, '说唱': 12, '轻音乐': 20, '爵士': 95,
                        'R&B/Soul': 49, '古典': 33, '民族': 21, '英伦': 35, '蓝调': 1, '雷鬼': 65, '世界音乐': 66, '拉丁': 92,
                        'New Age': 88, '古风': 35, 'Bossa Nova': 46},
                '145': {'流行': 51, '摇滚': 12, '民谣': 32, '电子': 35, '舞曲': 9, '说唱': 86, '轻音乐': 53, '爵士': 55,
                        'R&B/Soul': 4, '古典': 54, '民族': 29, '英伦': 86, '蓝调': 26, '雷鬼': 1, '世界音乐': 73, '拉丁': 88,
                        'New Age': 83, '古风': 2, 'Bossa Nova': 42},
                '146': {'流行': 17, '摇滚': 58, '民谣': 73, '电子': 51, '舞曲': 97, '说唱': 73, '轻音乐': 51, '爵士': 76,
                        'R&B/Soul': 40, '古典': 74, '民族': 30, '英伦': 39, '蓝调': 68, '雷鬼': 14, '世界音乐': 97, '拉丁': 4,
                        'New Age': 72, '古风': 6, 'Bossa Nova': 88},
                '147': {'流行': 95, '摇滚': 77, '民谣': 82, '电子': 24, '舞曲': 96, '说唱': 87, '轻音乐': 13, '爵士': 66,
                        'R&B/Soul': 75, '古典': 68, '民族': 75, '英伦': 94, '蓝调': 7, '雷鬼': 92, '世界音乐': 10, '拉丁': 26,
                        'New Age': 100, '古风': 45, 'Bossa Nova': 100},
                '148': {'流行': 29, '摇滚': 13, '民谣': 23, '电子': 16, '舞曲': 76, '说唱': 85, '轻音乐': 7, '爵士': 53,
                        'R&B/Soul': 40, '古典': 70, '民族': 3, '英伦': 45, '蓝调': 16, '雷鬼': 35, '世界音乐': 38, '拉丁': 2,
                        'New Age': 20, '古风': 80, 'Bossa Nova': 54},
                '149': {'流行': 30, '摇滚': 45, '民谣': 92, '电子': 58, '舞曲': 76, '说唱': 68, '轻音乐': 29, '爵士': 70,
                        'R&B/Soul': 83, '古典': 2, '民族': 62, '英伦': 97, '蓝调': 57, '雷鬼': 12, '世界音乐': 24, '拉丁': 9,
                        'New Age': 25, '古风': 39, 'Bossa Nova': 47},
                '150': {'流行': 91, '摇滚': 52, '民谣': 3, '电子': 42, '舞曲': 3, '说唱': 93, '轻音乐': 49, '爵士': 12,
                        'R&B/Soul': 71, '古典': 58, '民族': 49, '英伦': 40, '蓝调': 55, '雷鬼': 10, '世界音乐': 33,
                        '拉丁': 32,
                        'New Age': 87, '古风': 96, 'Bossa Nova': 45},
                '151': {'流行': 15, '摇滚': 54, '民谣': 4, '电子': 30, '舞曲': 62, '说唱': 19, '轻音乐': 60, '爵士': 7,
                        'R&B/Soul': 53, '古典': 60, '民族': 52, '英伦': 92, '蓝调': 43, '雷鬼': 23, '世界音乐': 51, '拉丁': 60,
                        'New Age': 75, '古风': 100, 'Bossa Nova': 40},
                '152': {'流行': 26, '摇滚': 32, '民谣': 47, '电子': 73, '舞曲': 50, '说唱': 24, '轻音乐': 90, '爵士': 27,
                        'R&B/Soul': 44, '古典': 27, '民族': 53, '英伦': 90, '蓝调': 82, '雷鬼': 64, '世界音乐': 8, '拉丁': 59,
                        'New Age': 13, '古风': 42, 'Bossa Nova': 38},
                '153': {'流行': 22, '摇滚': 14, '民谣': 88, '电子': 7, '舞曲': 80, '说唱': 47, '轻音乐': 65, '爵士': 28,
                        'R&B/Soul': 1, '古典': 93, '民族': 73, '英伦': 94, '蓝调': 65, '雷鬼': 45, '世界音乐': 27, '拉丁': 45,
                        'New Age': 22, '古风': 5, 'Bossa Nova': 3},
                '154': {'流行': 0, '摇滚': 79, '民谣': 35, '电子': 26, '舞曲': 60, '说唱': 84, '轻音乐': 12, '爵士': 49,
                        'R&B/Soul': 55, '古典': 86, '民族': 72, '英伦': 33, '蓝调': 66, '雷鬼': 32, '世界音乐': 81,
                        '拉丁': 25,
                        'New Age': 2, '古风': 13, 'Bossa Nova': 7},
                '155': {'流行': 82, '摇滚': 11, '民谣': 81, '电子': 92, '舞曲': 31, '说唱': 46, '轻音乐': 86, '爵士': 9,
                        'R&B/Soul': 83, '古典': 31, '民族': 52, '英伦': 61, '蓝调': 13, '雷鬼': 6, '世界音乐': 96, '拉丁': 89,
                        'New Age': 77, '古风': 71, 'Bossa Nova': 22},
                '156': {'流行': 9, '摇滚': 77, '民谣': 40, '电子': 83, '舞曲': 13, '说唱': 63, '轻音乐': 63, '爵士': 28,
                        'R&B/Soul': 71, '古典': 77, '民族': 31, '英伦': 70, '蓝调': 0, '雷鬼': 20, '世界音乐': 57, '拉丁': 38,
                        'New Age': 41, '古风': 13, 'Bossa Nova': 37},
                '157': {'流行': 87, '摇滚': 88, '民谣': 46, '电子': 44, '舞曲': 79, '说唱': 73, '轻音乐': 83, '爵士': 88,
                        'R&B/Soul': 34, '古典': 91, '民族': 1, '英伦': 72, '蓝调': 35, '雷鬼': 79, '世界音乐': 28, '拉丁': 22,
                        'New Age': 57, '古风': 76, 'Bossa Nova': 10},
                '158': {'流行': 22, '摇滚': 57, '民谣': 67, '电子': 52, '舞曲': 80, '说唱': 28, '轻音乐': 91, '爵士': 69,
                        'R&B/Soul': 31, '古典': 52, '民族': 74, '英伦': 83, '蓝调': 54, '雷鬼': 56, '世界音乐': 34,
                        '拉丁': 56,
                        'New Age': 77, '古风': 93, 'Bossa Nova': 39},
                '159': {'流行': 43, '摇滚': 53, '民谣': 53, '电子': 50, '舞曲': 16, '说唱': 90, '轻音乐': 35, '爵士': 66,
                        'R&B/Soul': 81, '古典': 75, '民族': 48, '英伦': 82, '蓝调': 62, '雷鬼': 23, '世界音乐': 95, '拉丁': 27,
                        'New Age': 6, '古风': 58, 'Bossa Nova': 59},
                '160': {'流行': 62, '摇滚': 21, '民谣': 53, '电子': 53, '舞曲': 62, '说唱': 79, '轻音乐': 43, '爵士': 83,
                        'R&B/Soul': 2, '古典': 74, '民族': 74, '英伦': 68, '蓝调': 56, '雷鬼': 29, '世界音乐': 75, '拉丁': 90,
                        'New Age': 49, '古风': 49, 'Bossa Nova': 19},
                '161': {'流行': 52, '摇滚': 82, '民谣': 40, '电子': 74, '舞曲': 2, '说唱': 38, '轻音乐': 77, '爵士': 98,
                        'R&B/Soul': 78, '古典': 47, '民族': 87, '英伦': 70, '蓝调': 28, '雷鬼': 87, '世界音乐': 24,
                        '拉丁': 48,
                        'New Age': 54, '古风': 5, 'Bossa Nova': 94},
                '162': {'流行': 70, '摇滚': 95, '民谣': 24, '电子': 64, '舞曲': 58, '说唱': 9, '轻音乐': 80, '爵士': 71,
                        'R&B/Soul': 33, '古典': 30, '民族': 58, '英伦': 2, '蓝调': 75, '雷鬼': 35, '世界音乐': 36, '拉丁': 71,
                        'New Age': 60, '古风': 53, 'Bossa Nova': 94},
                '163': {'流行': 34, '摇滚': 59, '民谣': 54, '电子': 59, '舞曲': 75, '说唱': 95, '轻音乐': 76, '爵士': 11,
                        'R&B/Soul': 96, '古典': 34, '民族': 73, '英伦': 9, '蓝调': 92, '雷鬼': 31, '世界音乐': 82, '拉丁': 42,
                        'New Age': 31, '古风': 17, 'Bossa Nova': 30},
                '164': {'流行': 43, '摇滚': 99, '民谣': 52, '电子': 59, '舞曲': 22, '说唱': 57, '轻音乐': 72, '爵士': 65,
                        'R&B/Soul': 56, '古典': 13, '民族': 50, '英伦': 11, '蓝调': 68, '雷鬼': 87, '世界音乐': 78,
                        '拉丁': 83,
                        'New Age': 74, '古风': 31, 'Bossa Nova': 4},
                '165': {'流行': 63, '摇滚': 77, '民谣': 27, '电子': 87, '舞曲': 35, '说唱': 67, '轻音乐': 9, '爵士': 50,
                        'R&B/Soul': 42, '古典': 53, '民族': 15, '英伦': 22, '蓝调': 74, '雷鬼': 80, '世界音乐': 66,
                        '拉丁': 97,
                        'New Age': 27, '古风': 33, 'Bossa Nova': 32},
                '166': {'流行': 22, '摇滚': 40, '民谣': 94, '电子': 89, '舞曲': 11, '说唱': 57, '轻音乐': 75, '爵士': 97,
                        'R&B/Soul': 39, '古典': 90, '民族': 3, '英伦': 96, '蓝调': 66, '雷鬼': 53, '世界音乐': 95, '拉丁': 40,
                        'New Age': 21, '古风': 15, 'Bossa Nova': 99},
                '167': {'流行': 2, '摇滚': 63, '民谣': 32, '电子': 30, '舞曲': 4, '说唱': 68, '轻音乐': 60, '爵士': 37,
                        'R&B/Soul': 61, '古典': 94, '民族': 75, '英伦': 14, '蓝调': 95, '雷鬼': 100, '世界音乐': 22,
                        '拉丁': 93,
                        'New Age': 1, '古风': 28, 'Bossa Nova': 30},
                '168': {'流行': 18, '摇滚': 47, '民谣': 60, '电子': 33, '舞曲': 4, '说唱': 99, '轻音乐': 45, '爵士': 48,
                        'R&B/Soul': 13, '古典': 29, '民族': 27, '英伦': 39, '蓝调': 64, '雷鬼': 64, '世界音乐': 78,
                        '拉丁': 29,
                        'New Age': 21, '古风': 3, 'Bossa Nova': 86},
                '169': {'流行': 46, '摇滚': 25, '民谣': 46, '电子': 22, '舞曲': 8, '说唱': 7, '轻音乐': 86, '爵士': 25,
                        'R&B/Soul': 75, '古典': 5, '民族': 9, '英伦': 85, '蓝调': 11, '雷鬼': 25, '世界音乐': 43, '拉丁': 33,
                        'New Age': 99, '古风': 75, 'Bossa Nova': 9},
                '170': {'流行': 69, '摇滚': 62, '民谣': 81, '电子': 35, '舞曲': 9, '说唱': 8, '轻音乐': 0, '爵士': 37,
                        'R&B/Soul': 30,
                        '古典': 36, '民族': 60, '英伦': 59, '蓝调': 25, '雷鬼': 93, '世界音乐': 33, '拉丁': 13, 'New Age': 41,
                        '古风': 98, 'Bossa Nova': 28},
                '171': {'流行': 61, '摇滚': 75, '民谣': 66, '电子': 55, '舞曲': 0, '说唱': 68, '轻音乐': 73, '爵士': 33,
                        'R&B/Soul': 18, '古典': 50, '民族': 19, '英伦': 13, '蓝调': 71, '雷鬼': 68, '世界音乐': 24,
                        '拉丁': 10,
                        'New Age': 86, '古风': 21, 'Bossa Nova': 71},
                '172': {'流行': 34, '摇滚': 21, '民谣': 24, '电子': 63, '舞曲': 65, '说唱': 91, '轻音乐': 56, '爵士': 51,
                        'R&B/Soul': 27, '古典': 71, '民族': 74, '英伦': 81, '蓝调': 87, '雷鬼': 83, '世界音乐': 70,
                        '拉丁': 39,
                        'New Age': 51, '古风': 73, 'Bossa Nova': 91},
                '173': {'流行': 30, '摇滚': 78, '民谣': 28, '电子': 34, '舞曲': 88, '说唱': 95, '轻音乐': 90, '爵士': 47,
                        'R&B/Soul': 67, '古典': 65, '民族': 68, '英伦': 7, '蓝调': 27, '雷鬼': 66, '世界音乐': 17, '拉丁': 11,
                        'New Age': 2, '古风': 80, 'Bossa Nova': 77},
                '174': {'流行': 44, '摇滚': 79, '民谣': 39, '电子': 50, '舞曲': 47, '说唱': 39, '轻音乐': 72, '爵士': 14,
                        'R&B/Soul': 34, '古典': 26, '民族': 3, '英伦': 19, '蓝调': 45, '雷鬼': 61, '世界音乐': 72, '拉丁': 59,
                        'New Age': 8, '古风': 28, 'Bossa Nova': 34},
                '175': {'流行': 85, '摇滚': 69, '民谣': 45, '电子': 57, '舞曲': 62, '说唱': 84, '轻音乐': 36, '爵士': 45,
                        'R&B/Soul': 55, '古典': 70, '民族': 98, '英伦': 92, '蓝调': 48, '雷鬼': 69, '世界音乐': 93,
                        '拉丁': 89,
                        'New Age': 9, '古风': 14, 'Bossa Nova': 29},
                '176': {'流行': 79, '摇滚': 50, '民谣': 66, '电子': 71, '舞曲': 81, '说唱': 46, '轻音乐': 47, '爵士': 6,
                        'R&B/Soul': 78, '古典': 86, '民族': 56, '英伦': 23, '蓝调': 54, '雷鬼': 88, '世界音乐': 55,
                        '拉丁': 53,
                        'New Age': 69, '古风': 26, 'Bossa Nova': 55},
                '177': {'流行': 20, '摇滚': 93, '民谣': 97, '电子': 89, '舞曲': 75, '说唱': 45, '轻音乐': 71, '爵士': 24,
                        'R&B/Soul': 79, '古典': 72, '民族': 69, '英伦': 81, '蓝调': 31, '雷鬼': 11, '世界音乐': 36,
                        '拉丁': 41,
                        'New Age': 85, '古风': 92, 'Bossa Nova': 91},
                '178': {'流行': 39, '摇滚': 22, '民谣': 36, '电子': 10, '舞曲': 83, '说唱': 96, '轻音乐': 90, '爵士': 53,
                        'R&B/Soul': 2, '古典': 70, '民族': 48, '英伦': 69, '蓝调': 44, '雷鬼': 3, '世界音乐': 36, '拉丁': 33,
                        'New Age': 42, '古风': 69, 'Bossa Nova': 60},
                '179': {'流行': 32, '摇滚': 70, '民谣': 26, '电子': 2, '舞曲': 6, '说唱': 96, '轻音乐': 62, '爵士': 68,
                        'R&B/Soul': 5,
                        '古典': 38, '民族': 33, '英伦': 74, '蓝调': 38, '雷鬼': 13, '世界音乐': 8, '拉丁': 93, 'New Age': 82,
                        '古风': 85, 'Bossa Nova': 8},
                '180': {'流行': 55, '摇滚': 6, '民谣': 77, '电子': 50, '舞曲': 76, '说唱': 70, '轻音乐': 51, '爵士': 80,
                        'R&B/Soul': 91, '古典': 57, '民族': 29, '英伦': 33, '蓝调': 95, '雷鬼': 34, '世界音乐': 66, '拉丁': 9,
                        'New Age': 53, '古风': 16, 'Bossa Nova': 31},
                '181': {'流行': 53, '摇滚': 64, '民谣': 47, '电子': 7, '舞曲': 89, '说唱': 18, '轻音乐': 14, '爵士': 43,
                        'R&B/Soul': 68, '古典': 11, '民族': 74, '英伦': 38, '蓝调': 15, '雷鬼': 42, '世界音乐': 16, '拉丁': 0,
                        'New Age': 71, '古风': 12, 'Bossa Nova': 13},
                '182': {'流行': 24, '摇滚': 9, '民谣': 25, '电子': 70, '舞曲': 38, '说唱': 55, '轻音乐': 87, '爵士': 57,
                        'R&B/Soul': 65, '古典': 70, '民族': 21, '英伦': 72, '蓝调': 25, '雷鬼': 46, '世界音乐': 70,
                        '拉丁': 32,
                        'New Age': 31, '古风': 17, 'Bossa Nova': 23},
                '183': {'流行': 29, '摇滚': 25, '民谣': 0, '电子': 87, '舞曲': 52, '说唱': 14, '轻音乐': 61, '爵士': 1,
                        'R&B/Soul': 57, '古典': 88, '民族': 3, '英伦': 91, '蓝调': 1, '雷鬼': 84, '世界音乐': 13, '拉丁': 68,
                        'New Age': 7, '古风': 88, 'Bossa Nova': 52},
                '184': {'流行': 76, '摇滚': 33, '民谣': 66, '电子': 42, '舞曲': 44, '说唱': 60, '轻音乐': 19, '爵士': 10,
                        'R&B/Soul': 88, '古典': 98, '民族': 14, '英伦': 90, '蓝调': 33, '雷鬼': 81, '世界音乐': 66,
                        '拉丁': 64,
                        'New Age': 66, '古风': 14, 'Bossa Nova': 63},
                '185': {'流行': 26, '摇滚': 85, '民谣': 52, '电子': 0, '舞曲': 77, '说唱': 98, '轻音乐': 10, '爵士': 67,
                        'R&B/Soul': 34, '古典': 9, '民族': 51, '英伦': 79, '蓝调': 72, '雷鬼': 77, '世界音乐': 15,
                        '拉丁': 100,
                        'New Age': 0, '古风': 36, 'Bossa Nova': 95},
                '186': {'流行': 4, '摇滚': 8, '民谣': 48, '电子': 45, '舞曲': 38, '说唱': 80, '轻音乐': 33, '爵士': 11,
                        'R&B/Soul': 93,
                        '古典': 18, '民族': 19, '英伦': 71, '蓝调': 6, '雷鬼': 57, '世界音乐': 55, '拉丁': 83, 'New Age': 48,
                        '古风': 4, 'Bossa Nova': 84},
                '187': {'流行': 46, '摇滚': 16, '民谣': 63, '电子': 14, '舞曲': 81, '说唱': 48, '轻音乐': 83, '爵士': 6,
                        'R&B/Soul': 12, '古典': 74, '民族': 56, '英伦': 29, '蓝调': 93, '雷鬼': 35, '世界音乐': 86, '拉丁': 7,
                        'New Age': 32, '古风': 8, 'Bossa Nova': 87},
                '188': {'流行': 47, '摇滚': 60, '民谣': 74, '电子': 31, '舞曲': 1, '说唱': 46, '轻音乐': 2, '爵士': 76,
                        'R&B/Soul': 71, '古典': 33, '民族': 10, '英伦': 74, '蓝调': 87, '雷鬼': 43, '世界音乐': 45,
                        '拉丁': 25,
                        'New Age': 40, '古风': 82, 'Bossa Nova': 33},
                '189': {'流行': 2, '摇滚': 34, '民谣': 0, '电子': 92, '舞曲': 21, '说唱': 9, '轻音乐': 69, '爵士': 19,
                        'R&B/Soul': 94,
                        '古典': 77, '民族': 78, '英伦': 80, '蓝调': 26, '雷鬼': 7, '世界音乐': 76, '拉丁': 15, 'New Age': 94,
                        '古风': 0, 'Bossa Nova': 91},
                '190': {'流行': 16, '摇滚': 82, '民谣': 14, '电子': 11, '舞曲': 95, '说唱': 52, '轻音乐': 82, '爵士': 22,
                        'R&B/Soul': 12, '古典': 82, '民族': 4, '英伦': 67, '蓝调': 36, '雷鬼': 47, '世界音乐': 73, '拉丁': 8,
                        'New Age': 65, '古风': 66, 'Bossa Nova': 61},
                '191': {'流行': 55, '摇滚': 90, '民谣': 0, '电子': 8, '舞曲': 84, '说唱': 6, '轻音乐': 17, '爵士': 49,
                        'R&B/Soul': 15,
                        '古典': 31, '民族': 53, '英伦': 51, '蓝调': 96, '雷鬼': 78, '世界音乐': 19, '拉丁': 97, 'New Age': 19,
                        '古风': 27, 'Bossa Nova': 41},
                '192': {'流行': 19, '摇滚': 60, '民谣': 57, '电子': 92, '舞曲': 35, '说唱': 87, '轻音乐': 78, '爵士': 77,
                        'R&B/Soul': 80, '古典': 96, '民族': 34, '英伦': 22, '蓝调': 22, '雷鬼': 39, '世界音乐': 73,
                        '拉丁': 76,
                        'New Age': 26, '古风': 61, 'Bossa Nova': 49},
                '193': {'流行': 71, '摇滚': 100, '民谣': 65, '电子': 6, '舞曲': 5, '说唱': 77, '轻音乐': 74, '爵士': 77,
                        'R&B/Soul': 51, '古典': 32, '民族': 2, '英伦': 14, '蓝调': 40, '雷鬼': 86, '世界音乐': 100, '拉丁': 7,
                        'New Age': 38, '古风': 52, 'Bossa Nova': 12},
                '194': {'流行': 20, '摇滚': 82, '民谣': 95, '电子': 81, '舞曲': 17, '说唱': 34, '轻音乐': 31, '爵士': 81,
                        'R&B/Soul': 29, '古典': 17, '民族': 88, '英伦': 43, '蓝调': 5, '雷鬼': 77, '世界音乐': 12, '拉丁': 18,
                        'New Age': 25, '古风': 18, 'Bossa Nova': 2},
                '195': {'流行': 88, '摇滚': 35, '民谣': 7, '电子': 50, '舞曲': 36, '说唱': 98, '轻音乐': 54, '爵士': 37,
                        'R&B/Soul': 8, '古典': 31, '民族': 47, '英伦': 12, '蓝调': 74, '雷鬼': 8, '世界音乐': 83, '拉丁': 95,
                        'New Age': 43, '古风': 17, 'Bossa Nova': 75},
                '196': {'流行': 41, '摇滚': 14, '民谣': 47, '电子': 68, '舞曲': 33, '说唱': 97, '轻音乐': 2, '爵士': 41,
                        'R&B/Soul': 73, '古典': 82, '民族': 11, '英伦': 89, '蓝调': 48, '雷鬼': 38, '世界音乐': 80,
                        '拉丁': 98,
                        'New Age': 82, '古风': 4, 'Bossa Nova': 78},
                '197': {'流行': 93, '摇滚': 98, '民谣': 24, '电子': 14, '舞曲': 16, '说唱': 30, '轻音乐': 0, '爵士': 8,
                        'R&B/Soul': 75, '古典': 100, '民族': 1, '英伦': 25, '蓝调': 9, '雷鬼': 53, '世界音乐': 32, '拉丁': 46,
                        'New Age': 51, '古风': 26, 'Bossa Nova': 14},
                '198': {'流行': 39, '摇滚': 91, '民谣': 25, '电子': 25, '舞曲': 83, '说唱': 17, '轻音乐': 7, '爵士': 3,
                        'R&B/Soul': 8,
                        '古典': 45, '民族': 79, '英伦': 93, '蓝调': 93, '雷鬼': 5, '世界音乐': 26, '拉丁': 61, 'New Age': 32,
                        '古风': 82, 'Bossa Nova': 32},
                '199': {'流行': 71, '摇滚': 53, '民谣': 68, '电子': 43, '舞曲': 60, '说唱': 75, '轻音乐': 44, '爵士': 23,
                        'R&B/Soul': 4, '古典': 62, '民族': 43, '英伦': 68, '蓝调': 32, '雷鬼': 36, '世界音乐': 8, '拉丁': 52,
                        'New Age': 11, '古风': 0, 'Bossa Nova': 78}}

        test[str(self.userid)] = self.cftest()
        user_score_dict = test
        return user_score_dict

    def ItemSimilarity(self):
        itemSim = dict()
        item_user_count = dict()
        count = dict()
        for user, item in self.user_score_dict.items():
            for i in item.keys():
                item_user_count.setdefault(i, 0)
                if self.user_score_dict[user][i] > 0.0:
                    item_user_count[i] += 1
                for j in item.keys():
                    count.setdefault(i, {}).setdefault(j, 0)
                    if (
                            self.user_score_dict[user][i] > 0.0
                            and self.user_score_dict[user][j] > 0.0
                            and i != j
                    ):
                        count[i][j] += 1
        for i, related_items in count.items():
            itemSim.setdefault(i, dict())
            for j, cuv in related_items.items():
                itemSim[i].setdefault(j, 0)
                itemSim[i][j] = cuv / item_user_count[i]
        return itemSim

    def ItemSimilarityBest(self):
        itemSim = dict()
        item_user_count = dict()
        count = dict()
        for user, item in self.user_score_dict.items():
            for i in item.keys():
                item_user_count.setdefault(i, 0)
                if self.user_score_dict[user][i] > 0.0:
                    item_user_count[i] += 1
                for j in item.keys():
                    count.setdefault(i, {}).setdefault(j, 0)
                    if (
                            self.user_score_dict[user][i] > 0.0
                            and self.user_score_dict[user][j] > 0.0
                            and i != j
                    ):
                        count[i][j] += 1
        # 共现矩阵 -> 相似度矩阵
        for i, related_items in count.items():
            itemSim.setdefault(i, dict())
            for j, cuv in related_items.items():
                itemSim[i].setdefault(j, 0)
                itemSim[i][j] = cuv / math.sqrt(item_user_count[i] * item_user_count[j])

        return itemSim

    def preUserItemScore(self, userA, item):
        score = 0.0
        for item1 in self.items_sim[item].keys():
            if item1 != item:
                score += (
                        self.items_sim[item][item1] * self.user_score_dict[userA][item1]
                )
        return score

    def recommend(self, userA):
        user_item_score_dict = dict()
        for item in self.user_score_dict[userA].keys():
            user_item_score_dict[item] = self.preUserItemScore(userA, item)

        return user_item_score_dict


def cfre(key):
    sql = 'select * from tb_music  where songlx = "{0}" ORDER BY RAND( )  limit 0,1'.format(key)
    res = query(sql)
    for i in res:
        data = {}
        data['songname'] = i[7]
        data['songtime'] = i[1]
        data['songimg'] = i[4]
        data['songauther'] = i[2]
        data['songpl'] = i[5]
        data['songlx'] = i[6]
        data['songzj'] = i[3]
        data['songid'] = i[0]
        return data


def gxre():
    sql = 'select * from tb_music  where songpl > 50000 ORDER BY RAND( )  limit 0,9'
    res = query(sql)
    allli = []
    for i in res:
        data = {}
        data['songname'] = i[7]
        data['songtime'] = i[1]
        data['songimg'] = i[4]
        data['songauther'] = i[2]
        data['songpl'] = i[5]
        data['songlx'] = i[6]
        data['songzj'] = i[3]
        data['songid'] = i[0]
        allli.append(data)
    return allli


def sea(key):
    sql = 'select * from tb_music where songname = "{0}" '.format(key)
    res = query(sql)
    allli = []
    for i in res:
        data = {}
        data['songname'] = i[7]
        data['songtime'] = i[1]
        data['songimg'] = i[4]
        data['songauther'] = i[2]
        data['songpl'] = i[5]
        data['songlx'] = i[6]
        data['songzj'] = i[3]
        data['songid'] = i[0]
        allli.append(data)
    return allli


def numsong():
    sql = 'select * from tb_music'
    res = query(sql)
    songnum = len(res)
    sql = 'select * from tb_con'
    res = query(sql)
    plnum = len(res)
    data = {
        'songnum': songnum,
        'plnum': plnum,
    }
    return data


def gettop():
    sql = 'select `songpl`,`songname` from tb_music order by songpl DESC'
    res = query(sql)
    songnum = []
    songname = []
    for i in res:
        if i[1] not in songname:
            songname.append(i[1])
            songnum.append(i[0])
            if len(songname) > 10:
                break
    data = {
        'songname': songname,
        'songnum': songnum,
    }
    return data


def getlx():
    lx_list = ['流行', '摇滚', '民谣', '电子', '舞曲', '说唱', '轻音乐', '爵士', 'R&B/Soul', '古典', '民族', '英伦', '蓝调', '雷鬼', '世界音乐', '拉丁',
               'New Age', '古风', 'Bossa Nova']

    data = []
    for x in lx_list:
        dict = {}
        sql = 'select * from tb_music where songlx = "{0}"'.format(x)
        dict['name'] = x
        dict['value'] = len(query(sql))
        data.append(dict)
    return data


def getlxtop():
    lx_list = ['流行', '摇滚', '民谣', '电子', '舞曲', '说唱', '轻音乐', '爵士', 'R&B/Soul','古典', '民族', '英伦', '蓝调', '雷鬼', '世界音乐', '拉丁', 'New Age', '古风', 'Bossa Nova']

    data = []
    datapl = []
    for x in lx_list:
        sql = 'select * from tb_music where songlx = "{0}" order by songpl desc limit 0,1'.format(x)
        datapl.append(query(sql)[0][5])
        data.append(query(sql)[0][3])
    dict = {
        'name': data,
        'value': datapl
    }
    return dict


def getauther():
    sql = 'select * from tb_con order by likecont desc  limit 0,3'
    res = query(sql)
    data = []
    for i in res:
        dict = {}
        dict['id'] = i[0]
        dict['username'] = i[1]
        dict['usercontent'] = i[2]
        dict['cont'] = i[3]
        data.append(dict)
    return data


def adminallsong():
    sql = 'select * from tb_music'
    res = query(sql)
    allli = []
    for i in res:
        data = {}
        data['songname'] = i[7]
        data['songtime'] = i[1]
        data['songimg'] = i[4]
        data['songauther'] = i[2]
        data['songpl'] = i[5]
        data['songlx'] = i[6]
        data['songzj'] = i[3]
        data['songid'] = i[0]
        allli.append(data)
    return allli


def admingetuser():
    sql = 'select * from tb_user limit 0,30'
    res = query(sql)
    data = []
    for i in res:
        dict = {}
        sql = 'select songid from tb_user_sc where userid = {0}'.format(i[0])
        res = query(sql)
        xh = []
        for x in res:
            sql = 'select songlx from tb_music where songid = {0}'.format(x[0])
            res = query(sql)
            xh.append(res[0][0])
        try:
            dict['userxh'] = max(xh, key=xh.count)
        except:
            dict['userxh'] = '暂时没有推荐'
        dict['userid'] = i[0]
        dict['username'] = i[8]
        dict['usersex'] = i[5]
        dict['useradd'] = i[7]
        data.append(dict)
    return data


# 数据库去重
def clean():
    sql = 'select * from tb_music '
    res = query(sql)
    for i in res:
        try:
            sql = 'insert into tb_music(`songid`,`songtime`,`songauther`,`songzj`,`songimg`,`songpl`,`songlx`,`songname`) values("%s","%s","%s","%s","%s","%s","%s","%s")' % (
                i[0], i[1], i[2], i[3], i[4], i[5], i[6], i[7]
            )
            insert(sql)
        except Exception as e:
            continue


def admindel(id):
    sql = 'delete from tb_music where songid = {0}'.format(id)
    insert(sql)


def admindeluser(id):
    sql = 'delete from tb_user where userid = {0}'.format(id)
    insert(sql)


def getlink(songid):
    ch_options = Options()
    ch_options.add_argument("--headless")  # => 为Chrome配置无头模式

    # 在启动浏览器时加入配置
    driver = webdriver.Chrome(r'C:\Users\Administrator\Desktop\update\music\page\page\chromedriver.exe',
                              options=ch_options)
    try:
        songurl = 'https://music.163.com/#/song?id=' + songid
        driver.get(songurl)
        driver.switch_to.frame("g_iframe")
        page = driver.page_source
        etree = html.etree.HTML(page)
        songid = songid
        songimg = etree.xpath(
            '/html/body/div[3]/div[1]/div/div/div[1]/div[1]/div[1]/div[1]/img/@data-src')
        songzj = etree.xpath('/html/body/div[3]/div[1]/div/div/div[1]/div[1]/div[2]/p[2]/a/text()')
        songpl = etree.xpath('//*[@id="cnt_comment_count"]/text()')
        songname = etree.xpath(
            '/html/body/div[3]/div[1]/div/div/div[1]/div[1]/div[2]/div[1]/div/em/text()')

        songauther = etree.xpath('/html/body/div[3]/div[1]/div/div/div[1]/div[1]/div[2]/p[1]/span/a/text()')
        time_href = "https://music.163.com/#" + \
                    etree.xpath('/html/body/div[3]/div[1]/div/div/div[1]/div[1]/div[2]/p[2]/a/@href')[0]
        driver.get(time_href)
        driver.switch_to.frame("g_iframe")
        time_page = driver.page_source
        time_etree = html.etree.HTML(time_page)
        songtime = time_etree.xpath(
            '/html/body/div[3]/div[1]/div/div/div[3]/div[2]/div/div[1]/table/tbody/tr/td[3]/span/text()')

        redata = {
            'info': "获取成功",
            'songid': songid[0],
            'songtime': songtime[0],
            'songauther': songauther[0],
            'songzj': songzj[0],
            'songimg': songimg[0],
            'songpl': songpl[0],
            'songname': songname[0],
        }
        return redata
    except Exception as e:
        data = {
            'info': '歌曲ID有误'
        }
        return data


def concert():
    sql = 'select * from tb_concert'
    res = query(sql)
    data = []
    for i in res:
        dict = {}
        dict['id'] = i[5]
        dict['img'] = i[0]
        dict['name'] = i[1]
        dict['add'] = i[2].split('\n        ')[1]
        dict['time'] = i[3].split('\n        ')[1]
        dict['price'] = i[4].split('\n        ')[1]
        dict['info'] = i[6]
        data.append(dict)
    return data


def getpaihang():
    sql = 'select * from tb_music_lx'
    res = query(sql)
    data = []
    for i in res:
        list = []
        sql = 'select * from tb_music where songlx like "%{0}%" order by songpl desc limit 0,10'.format(i[1])
        resli = query(sql)
        for x in resli:
            dict = {}
            dict['name'] = x[3]
            dict['zz'] = x[2]
            dict['pl'] = x[5]
            dict['lx'] = x[6]
            dict['id'] = x[0]
            list.append(dict)
        data.append(list)
    return data


def getallsongdata():
    import pandas as pd
    sql = 'select * from tb_music'
    res = query(sql)
    col = ['songid', 'songtime', 'songauther', 'songzj', 'songimg', 'songpl', 'songlx', 'songname']
    df = pd.DataFrame(res, columns=col)
    lxlist = list(set(df['songlx'].tolist()))
    songaz = list(set(df['songauther'].tolist()))
    lxdata = []
    pldata = []
    plnamedata = []
    for i in lxlist:
        lxdata.append(list(df[df['songlx'] == i].count())[0])
        pldata.append(sum(list(df[df['songlx'] == i]['songpl'])))
        key = {
            'name': i,
            'value': sum(list(df[df['songlx'] == i]['songpl']))
        }
        plnamedata.append(key)

    data = {
        'lxlist': lxlist,
        'lxdata': lxdata,
        'pldata': pldata,
        'plnamedata': plnamedata
    }
    return data


def ciyun():
    sql = 'select content from tb_con'
    res = query(sql)
    word_space_split = ""  # 定义文本
    for i in res:
        word_space_split += str(i[0])  # 添加文本
    word = jieba.cut(word_space_split)  # 文本分词
    txt = " ".join(word)
    my_wordcloud = WordCloud(font_path="../static/assets/fonts/nucleo.ttf", scale=16,
                             max_words=2000, max_font_size=50, random_state=30).generate(
        txt)  # 注：song.ttc  设置展示的图文的字体
    my_wordcloud.to_file("../static/image/result1.png")  # 保


if __name__ == '__main__':
    ciyun()
